{"format": "layers-model", "generatedBy": null, "convertedBy": "TensorFlow.js Converter v4.20.0", "modelTopology": null, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "embedding_2/embeddings", "shape": [5000, 128], "dtype": "float32"}, {"name": "bidirectional_4/forward_lstm_4/lstm_cell/kernel", "shape": [128, 256], "dtype": "float32"}, {"name": "bidirectional_4/forward_lstm_4/lstm_cell/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_4/forward_lstm_4/lstm_cell/bias", "shape": [256], "dtype": "float32"}, {"name": "bidirectional_4/backward_lstm_4/lstm_cell/kernel", "shape": [128, 256], "dtype": "float32"}, {"name": "bidirectional_4/backward_lstm_4/lstm_cell/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_4/backward_lstm_4/lstm_cell/bias", "shape": [256], "dtype": "float32"}, {"name": "bidirectional_5/forward_lstm_5/lstm_cell/kernel", "shape": [128, 128], "dtype": "float32"}, {"name": "bidirectional_5/forward_lstm_5/lstm_cell/recurrent_kernel", "shape": [32, 128], "dtype": "float32"}, {"name": "bidirectional_5/forward_lstm_5/lstm_cell/bias", "shape": [128], "dtype": "float32"}, {"name": "bidirectional_5/backward_lstm_5/lstm_cell/kernel", "shape": [128, 128], "dtype": "float32"}, {"name": "bidirectional_5/backward_lstm_5/lstm_cell/recurrent_kernel", "shape": [32, 128], "dtype": "float32"}, {"name": "bidirectional_5/backward_lstm_5/lstm_cell/bias", "shape": [128], "dtype": "float32"}, {"name": "dense_2/kernel", "shape": [64, 1], "dtype": "float32"}, {"name": "dense_2/bias", "shape": [1], "dtype": "float32"}]}]}